; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-4-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	p1-0 - location
	p2-1 - location
	p2-7 - location
	p3-0 - location
	p3-6 - location
	p3-10 - location
	p3-11 - location
	p4-0 - location
	p4-3 - location
	p6-2 - location
	p6-7 - location
	p7-5 - location
	p7-9 - location
	p8-3 - location
	p8-6 - location
	p9-6 - location
	p10-0 - location
	p10-9 - location
	p11-4 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s6)
	(at driver3 s10)
	(at driver4 s3)
	(at driver5 s6)
	(at truck1 s11)
	(empty truck1)
	(at truck2 s11)
	(empty truck2)
	(at truck3 s11)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at package1 s10)
	(at package2 s2)
	(at package3 s4)
	(at package4 s5)
	(at package5 s1)
	(at package6 s9)
	(at package7 s4)
	(at package8 s1)
	(at package9 s8)
	(at package10 s4)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 49)
	(= (time-to-walk p1-0 s1) 49)
	(= (time-to-walk s0 p1-0) 72)
	(= (time-to-walk p1-0 s0) 72)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 17)
	(= (time-to-walk p2-1 s2) 17)
	(= (time-to-walk s1 p2-1) 36)
	(= (time-to-walk p2-1 s1) 36)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(= (time-to-walk s2 p2-7) 95)
	(= (time-to-walk p2-7 s2) 95)
	(= (time-to-walk s7 p2-7) 60)
	(= (time-to-walk p2-7 s7) 60)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 39)
	(= (time-to-walk p3-0 s3) 39)
	(= (time-to-walk s0 p3-0) 30)
	(= (time-to-walk p3-0 s0) 30)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 59)
	(= (time-to-walk p3-6 s3) 59)
	(= (time-to-walk s6 p3-6) 26)
	(= (time-to-walk p3-6 s6) 26)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(= (time-to-walk s3 p3-10) 74)
	(= (time-to-walk p3-10 s3) 74)
	(= (time-to-walk s10 p3-10) 49)
	(= (time-to-walk p3-10 s10) 49)
	(path s3 p3-11)
	(path p3-11 s3)
	(path s11 p3-11)
	(path p3-11 s11)
	(= (time-to-walk s3 p3-11) 56)
	(= (time-to-walk p3-11 s3) 56)
	(= (time-to-walk s11 p3-11) 91)
	(= (time-to-walk p3-11 s11) 91)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 70)
	(= (time-to-walk p4-0 s4) 70)
	(= (time-to-walk s0 p4-0) 60)
	(= (time-to-walk p4-0 s0) 60)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 69)
	(= (time-to-walk p4-3 s4) 69)
	(= (time-to-walk s3 p4-3) 44)
	(= (time-to-walk p4-3 s3) 44)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 24)
	(= (time-to-walk p6-2 s6) 24)
	(= (time-to-walk s2 p6-2) 6)
	(= (time-to-walk p6-2 s2) 6)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(= (time-to-walk s6 p6-7) 15)
	(= (time-to-walk p6-7 s6) 15)
	(= (time-to-walk s7 p6-7) 1)
	(= (time-to-walk p6-7 s7) 1)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(= (time-to-walk s7 p7-5) 20)
	(= (time-to-walk p7-5 s7) 20)
	(= (time-to-walk s5 p7-5) 86)
	(= (time-to-walk p7-5 s5) 86)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(= (time-to-walk s7 p7-9) 76)
	(= (time-to-walk p7-9 s7) 76)
	(= (time-to-walk s9 p7-9) 89)
	(= (time-to-walk p7-9 s9) 89)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(= (time-to-walk s8 p8-3) 51)
	(= (time-to-walk p8-3 s8) 51)
	(= (time-to-walk s3 p8-3) 69)
	(= (time-to-walk p8-3 s3) 69)
	(path s8 p8-6)
	(path p8-6 s8)
	(path s6 p8-6)
	(path p8-6 s6)
	(= (time-to-walk s8 p8-6) 26)
	(= (time-to-walk p8-6 s8) 26)
	(= (time-to-walk s6 p8-6) 33)
	(= (time-to-walk p8-6 s6) 33)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(= (time-to-walk s9 p9-6) 6)
	(= (time-to-walk p9-6 s9) 6)
	(= (time-to-walk s6 p9-6) 75)
	(= (time-to-walk p9-6 s6) 75)
	(path s10 p10-0)
	(path p10-0 s10)
	(path s0 p10-0)
	(path p10-0 s0)
	(= (time-to-walk s10 p10-0) 5)
	(= (time-to-walk p10-0 s10) 5)
	(= (time-to-walk s0 p10-0) 22)
	(= (time-to-walk p10-0 s0) 22)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(= (time-to-walk s10 p10-9) 10)
	(= (time-to-walk p10-9 s10) 10)
	(= (time-to-walk s9 p10-9) 99)
	(= (time-to-walk p10-9 s9) 99)
	(path s11 p11-4)
	(path p11-4 s11)
	(path s4 p11-4)
	(path p11-4 s4)
	(= (time-to-walk s11 p11-4) 81)
	(= (time-to-walk p11-4 s11) 81)
	(= (time-to-walk s4 p11-4) 49)
	(= (time-to-walk p11-4 s4) 49)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 29)
	(= (time-to-drive s1 s0) 29)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 39)
	(= (time-to-drive s3 s0) 39)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 74)
	(= (time-to-drive s7 s0) 74)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 3)
	(= (time-to-drive s8 s0) 3)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 87)
	(= (time-to-drive s11 s0) 87)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 29)
	(= (time-to-drive s4 s1) 29)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 93)
	(= (time-to-drive s1 s2) 93)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 56)
	(= (time-to-drive s11 s2) 56)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 89)
	(= (time-to-drive s1 s3) 89)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 61)
	(= (time-to-drive s5 s3) 61)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 100)
	(= (time-to-drive s6 s3) 100)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 12)
	(= (time-to-drive s2 s4) 12)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 66)
	(= (time-to-drive s3 s4) 66)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 15)
	(= (time-to-drive s11 s4) 15)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 13)
	(= (time-to-drive s1 s5) 13)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 85)
	(= (time-to-drive s2 s5) 85)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 100)
	(= (time-to-drive s6 s5) 100)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 89)
	(= (time-to-drive s9 s5) 89)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 74)
	(= (time-to-drive s8 s6) 74)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 50)
	(= (time-to-drive s3 s7) 50)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 57)
	(= (time-to-drive s5 s7) 57)
	(link s7 s10)
	(link s10 s7)
	(= (time-to-drive s7 s10) 100)
	(= (time-to-drive s10 s7) 100)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 83)
	(= (time-to-drive s11 s7) 83)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 62)
	(= (time-to-drive s2 s8) 62)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 74)
	(= (time-to-drive s3 s8) 74)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 87)
	(= (time-to-drive s4 s8) 87)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 83)
	(= (time-to-drive s2 s9) 83)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 83)
	(= (time-to-drive s2 s10) 83)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 86)
	(= (time-to-drive s6 s10) 86)
	(link s10 s11)
	(link s11 s10)
	(= (time-to-drive s10 s11) 63)
	(= (time-to-drive s11 s10) 63)
	(link s11 s1)
	(link s1 s11)
	(= (time-to-drive s11 s1) 32)
	(= (time-to-drive s1 s11) 32)
	(link s11 s5)
	(link s5 s11)
	(= (time-to-drive s11 s5) 15)
	(= (time-to-drive s5 s11) 15)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 2)
	(= (time-to-drive s8 s11) 2)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 6)
	(= (time-to-drive s9 s11) 6)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver3 s5)
	(at driver4 s8)
	(at driver5 s7)
	(at truck1 s1)
	(at truck2 s11)
	(at truck3 s2)
	(at package1 s9)
	(at package3 s11)
	(at package4 s10)
	(at package6 s8)
	(at package7 s8)
	(at package8 s8)
	(at package9 s7)
	(at package10 s9)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 4  (driven))) (* 2  (walked))))

)

; plan
1. (walk driver5 s6 p6-7)
   deleted: (at driver5 s6)
   added: (at driver5 p6-7)
   changed: (walked) from 0 to 15
   goals met: 1 of 14
2. (walk driver5 p6-7 s7)
   deleted: (at driver5 p6-7)
   added: (at driver5 s7)
   changed: (walked) from 15 to 16
   goals met: 2 of 14
3. (walk driver4 s3 p3-11)
   deleted: (at driver4 s3)
   added: (at driver4 p3-11)
   changed: (walked) from 16 to 72
   goals met: 2 of 14
4. (walk driver3 s10 p10-0)
   deleted: (at driver3 s10)
   added: (at driver3 p10-0)
   changed: (walked) from 72 to 77
   goals met: 2 of 14
5. (walk driver4 p3-11 s11)
   deleted: (at driver4 p3-11)
   added: (at driver4 s11)
   changed: (walked) from 77 to 168
   goals met: 2 of 14
6. (board-truck driver4 truck1 s11)
   deleted: (at driver4 s11) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 2 of 14
7. (walk driver3 p10-0 s0)
   deleted: (at driver3 p10-0)
   added: (at driver3 s0)
   changed: (walked) from 168 to 190
   goals met: 2 of 14
8. (drive-truck truck1 s11 s1 driver4)
   deleted: (at truck1 s11)
   added: (at truck1 s1)
   changed: (driven) from 0 to 32
   goals met: 3 of 14
9. (load-truck package8 truck1 s1)
   deleted: (at package8 s1)
   added: (in package8 truck1)
   goals met: 3 of 14
10. (drive-truck truck1 s1 s11 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s11)
   changed: (driven) from 32 to 64
   goals met: 2 of 14
11. (drive-truck truck1 s11 s8 driver4)
   deleted: (at truck1 s11)
   added: (at truck1 s8)
   changed: (driven) from 64 to 66
   goals met: 2 of 14
12. (unload-truck package8 truck1 s8)
   deleted: (in package8 truck1)
   added: (at package8 s8)
   goals met: 3 of 14
13. (load-truck package9 truck1 s8)
   deleted: (at package9 s8)
   added: (in package9 truck1)
   goals met: 3 of 14
14. (drive-truck truck1 s8 s0 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s0)
   changed: (driven) from 66 to 69
   goals met: 3 of 14
15. (disembark-truck driver4 truck1 s0)
   deleted: (driving driver4 truck1)
   added: (at driver4 s0) (empty truck1)
   goals met: 3 of 14
16. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 3 of 14
17. (drive-truck truck1 s0 s7 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   changed: (driven) from 69 to 143
   goals met: 3 of 14
18. (unload-truck package9 truck1 s7)
   deleted: (in package9 truck1)
   added: (at package9 s7)
   goals met: 4 of 14
19. (drive-truck truck1 s7 s11 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s11)
   changed: (driven) from 143 to 226
   goals met: 4 of 14
20. (drive-truck truck1 s11 s9 driver3)
   deleted: (at truck1 s11)
   added: (at truck1 s9)
   changed: (driven) from 226 to 232
   goals met: 4 of 14
21. (load-truck package6 truck1 s9)
   deleted: (at package6 s9)
   added: (in package6 truck1)
   goals met: 4 of 14
22. (walk driver4 s0 p3-0)
   deleted: (at driver4 s0)
   added: (at driver4 p3-0)
   changed: (walked) from 190 to 220
   goals met: 4 of 14
23. (drive-truck truck1 s9 s5 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s5)
   changed: (driven) from 232 to 321
   goals met: 4 of 14
24. (load-truck package4 truck1 s5)
   deleted: (at package4 s5)
   added: (in package4 truck1)
   goals met: 4 of 14
25. (drive-truck truck1 s5 s1 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (driven) from 321 to 334
   goals met: 5 of 14
26. (walk driver4 p3-0 s3)
   deleted: (at driver4 p3-0)
   added: (at driver4 s3)
   changed: (walked) from 220 to 259
   goals met: 5 of 14
27. (walk driver4 s3 p8-3)
   deleted: (at driver4 s3)
   added: (at driver4 p8-3)
   changed: (walked) from 259 to 328
   goals met: 5 of 14
28. (walk driver4 p8-3 s8)
   deleted: (at driver4 p8-3)
   added: (at driver4 s8)
   changed: (walked) from 328 to 379
   goals met: 6 of 14
29. (drive-truck truck1 s1 s4 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (driven) from 334 to 363
   goals met: 5 of 14
30. (load-truck package10 truck1 s4)
   deleted: (at package10 s4)
   added: (in package10 truck1)
   goals met: 5 of 14
31. (load-truck package3 truck1 s4)
   deleted: (at package3 s4)
   added: (in package3 truck1)
   goals met: 5 of 14
32. (load-truck package7 truck1 s4)
   deleted: (at package7 s4)
   added: (in package7 truck1)
   goals met: 5 of 14
33. (drive-truck truck1 s4 s11 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s11)
   changed: (driven) from 363 to 378
   goals met: 5 of 14
34. (unload-truck package3 truck1 s11)
   deleted: (in package3 truck1)
   added: (at package3 s11)
   goals met: 6 of 14
35. (drive-truck truck1 s11 s8 driver3)
   deleted: (at truck1 s11)
   added: (at truck1 s8)
   changed: (driven) from 378 to 380
   goals met: 6 of 14
36. (unload-truck package6 truck1 s8)
   deleted: (in package6 truck1)
   added: (at package6 s8)
   goals met: 7 of 14
37. (unload-truck package7 truck1 s8)
   deleted: (in package7 truck1)
   added: (at package7 s8)
   goals met: 8 of 14
38. (drive-truck truck1 s8 s11 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s11)
   changed: (driven) from 380 to 382
   goals met: 8 of 14
39. (drive-truck truck1 s11 s10 driver3)
   deleted: (at truck1 s11)
   added: (at truck1 s10)
   changed: (driven) from 382 to 445
   goals met: 8 of 14
40. (load-truck package1 truck1 s10)
   deleted: (at package1 s10)
   added: (in package1 truck1)
   goals met: 8 of 14
41. (drive-truck truck1 s10 s11 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s11)
   changed: (driven) from 445 to 508
   goals met: 8 of 14
42. (drive-truck truck1 s11 s9 driver3)
   deleted: (at truck1 s11)
   added: (at truck1 s9)
   changed: (driven) from 508 to 514
   goals met: 8 of 14
43. (unload-truck package10 truck1 s9)
   deleted: (in package10 truck1)
   added: (at package10 s9)
   goals met: 9 of 14
44. (unload-truck package1 truck1 s9)
   deleted: (in package1 truck1)
   added: (at package1 s9)
   goals met: 10 of 14
45. (drive-truck truck1 s9 s11 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s11)
   changed: (driven) from 514 to 520
   goals met: 10 of 14
46. (drive-truck truck1 s11 s10 driver3)
   deleted: (at truck1 s11)
   added: (at truck1 s10)
   changed: (driven) from 520 to 583
   goals met: 10 of 14
47. (unload-truck package4 truck1 s10)
   deleted: (in package4 truck1)
   added: (at package4 s10)
   goals met: 11 of 14
48. (drive-truck truck1 s10 s6 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s6)
   changed: (driven) from 583 to 669
   goals met: 11 of 14
49. (disembark-truck driver3 truck1 s6)
   deleted: (driving driver3 truck1)
   added: (at driver3 s6) (empty truck1)
   goals met: 11 of 14
50. (board-truck driver2 truck1 s6)
   deleted: (at driver2 s6) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 11 of 14
51. (drive-truck truck1 s6 s5 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (driven) from 669 to 769
   goals met: 11 of 14
52. (drive-truck truck1 s5 s11 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s11)
   changed: (driven) from 769 to 784
   goals met: 11 of 14
53. (walk driver3 s6 p3-6)
   deleted: (at driver3 s6)
   added: (at driver3 p3-6)
   changed: (walked) from 379 to 405
   goals met: 11 of 14
54. (drive-truck truck1 s11 s1 driver2)
   deleted: (at truck1 s11)
   added: (at truck1 s1)
   changed: (driven) from 784 to 816
   goals met: 12 of 14
55. (walk driver3 p3-6 s3)
   deleted: (at driver3 p3-6)
   added: (at driver3 s3)
   changed: (walked) from 405 to 464
   goals met: 12 of 14
56. (drive-truck truck1 s1 s3 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (driven) from 816 to 905
   goals met: 11 of 14
57. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 11 of 14
58. (walk driver3 s3 p3-11)
   deleted: (at driver3 s3)
   added: (at driver3 p3-11)
   changed: (walked) from 464 to 520
   goals met: 11 of 14
59. (walk driver3 p3-11 s11)
   deleted: (at driver3 p3-11)
   added: (at driver3 s11)
   changed: (walked) from 520 to 611
   goals met: 11 of 14
60. (board-truck driver3 truck2 s11)
   deleted: (at driver3 s11) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 11 of 14
61. (drive-truck truck2 s11 s5 driver3)
   deleted: (at truck2 s11)
   added: (at truck2 s5)
   changed: (driven) from 905 to 920
   goals met: 10 of 14
62. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 11 of 14
63. (walk driver2 s3 p3-11)
   deleted: (at driver2 s3)
   added: (at driver2 p3-11)
   changed: (walked) from 611 to 667
   goals met: 11 of 14
64. (walk driver2 p3-11 s11)
   deleted: (at driver2 p3-11)
   added: (at driver2 s11)
   changed: (walked) from 667 to 758
   goals met: 11 of 14
65. (board-truck driver2 truck3 s11)
   deleted: (at driver2 s11) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 11 of 14
66. (drive-truck truck3 s11 s2 driver2)
   deleted: (at truck3 s11)
   added: (at truck3 s2)
   changed: (driven) from 920 to 976
   goals met: 12 of 14
67. (walk driver4 s8 p8-3)
   deleted: (at driver4 s8)
   added: (at driver4 p8-3)
   changed: (walked) from 758 to 809
   goals met: 11 of 14
68. (walk driver4 p8-3 s3)
   deleted: (at driver4 p8-3)
   added: (at driver4 s3)
   changed: (walked) from 809 to 878
   goals met: 11 of 14
69. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 11 of 14
70. (board-truck driver3 truck2 s5)
   deleted: (at driver3 s5) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 10 of 14
71. (drive-truck truck2 s5 s11 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s11)
   changed: (driven) from 976 to 991
   goals met: 11 of 14
72. (drive-truck truck1 s3 s1 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (driven) from 991 to 1080
   goals met: 12 of 14
73. (disembark-truck driver3 truck2 s11)
   deleted: (driving driver3 truck2)
   added: (at driver3 s11) (empty truck2)
   goals met: 12 of 14
74. (drive-truck truck1 s1 s3 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (driven) from 1080 to 1169
   goals met: 11 of 14
75. (drive-truck truck1 s3 s8 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   changed: (driven) from 1169 to 1243
   goals met: 11 of 14
76. (drive-truck truck1 s8 s2 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s2)
   changed: (driven) from 1243 to 1305
   goals met: 11 of 14
77. (disembark-truck driver4 truck1 s2)
   deleted: (driving driver4 truck1)
   added: (at driver4 s2) (empty truck1)
   goals met: 11 of 14
78. (board-truck driver4 truck4 s2)
   deleted: (at driver4 s2) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 11 of 14
79. (drive-truck truck4 s2 s8 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s8)
   changed: (driven) from 1305 to 1367
   goals met: 11 of 14
80. (drive-truck truck3 s2 s11 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s11)
   changed: (driven) from 1367 to 1423
   goals met: 10 of 14
81. (disembark-truck driver4 truck4 s8)
   deleted: (driving driver4 truck4)
   added: (at driver4 s8) (empty truck4)
   goals met: 11 of 14
82. (walk driver5 s7 p2-7)
   deleted: (at driver5 s7)
   added: (at driver5 p2-7)
   changed: (walked) from 878 to 938
   goals met: 10 of 14
83. (drive-truck truck3 s11 s5 driver2)
   deleted: (at truck3 s11)
   added: (at truck3 s5)
   changed: (driven) from 1423 to 1438
   goals met: 10 of 14
84. (board-truck driver3 truck2 s11)
   deleted: (at driver3 s11) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 10 of 14
85. (drive-truck truck2 s11 s5 driver3)
   deleted: (at truck2 s11)
   added: (at truck2 s5)
   changed: (driven) from 1438 to 1453
   goals met: 9 of 14
86. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 10 of 14
87. (walk driver5 p2-7 s2)
   deleted: (at driver5 p2-7)
   added: (at driver5 s2)
   changed: (walked) from 938 to 1033
   goals met: 10 of 14
88. (board-truck driver5 truck1 s2)
   deleted: (at driver5 s2) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 10 of 14
89. (drive-truck truck1 s2 s1 driver5)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 1453 to 1546
   goals met: 11 of 14
90. (board-truck driver3 truck2 s5)
   deleted: (at driver3 s5) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 10 of 14
91. (drive-truck truck2 s5 s7 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   changed: (driven) from 1546 to 1603
   goals met: 10 of 14
92. (drive-truck truck1 s1 s5 driver5)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 1603 to 1616
   goals met: 9 of 14
93. (drive-truck truck3 s5 s2 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   changed: (driven) from 1616 to 1701
   goals met: 10 of 14
94. (drive-truck truck1 s5 s7 driver5)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   changed: (driven) from 1701 to 1758
   goals met: 10 of 14
95. (disembark-truck driver5 truck1 s7)
   deleted: (driving driver5 truck1)
   added: (at driver5 s7) (empty truck1)
   goals met: 11 of 14
96. (disembark-truck driver3 truck2 s7)
   deleted: (driving driver3 truck2)
   added: (at driver3 s7) (empty truck2)
   goals met: 11 of 14
97. (board-truck driver5 truck1 s7)
   deleted: (at driver5 s7) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 10 of 14
98. (walk driver3 s7 p7-5)
   deleted: (at driver3 s7)
   added: (at driver3 p7-5)
   changed: (walked) from 1033 to 1053
   goals met: 10 of 14
99. (walk driver3 p7-5 s5)
   deleted: (at driver3 p7-5)
   added: (at driver3 s5)
   changed: (walked) from 1053 to 1139
   goals met: 11 of 14
100. (board-truck driver1 truck2 s7)
   deleted: (at driver1 s7) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 11 of 14
101. (drive-truck truck2 s7 s11 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s11)
   changed: (driven) from 1758 to 1841
   goals met: 12 of 14
102. (drive-truck truck1 s7 s11 driver5)
   deleted: (at truck1 s7)
   added: (at truck1 s11)
   changed: (driven) from 1841 to 1924
   goals met: 12 of 14
103. (drive-truck truck1 s11 s1 driver5)
   deleted: (at truck1 s11)
   added: (at truck1 s1)
   changed: (driven) from 1924 to 1956
   goals met: 13 of 14
104. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 13 of 14
105. (disembark-truck driver5 truck1 s1)
   deleted: (driving driver5 truck1)
   added: (at driver5 s1) (empty truck1)
   goals met: 13 of 14
106. (disembark-truck driver1 truck2 s11)
   deleted: (driving driver1 truck2)
   added: (at driver1 s11) (empty truck2)
   goals met: 13 of 14
107. (walk driver5 s1 p2-1)
   deleted: (at driver5 s1)
   added: (at driver5 p2-1)
   changed: (walked) from 1139 to 1175
   goals met: 13 of 14
108. (walk driver5 p2-1 s2)
   deleted: (at driver5 p2-1)
   added: (at driver5 s2)
   changed: (walked) from 1175 to 1192
   goals met: 13 of 14
109. (walk driver5 s2 p2-7)
   deleted: (at driver5 s2)
   added: (at driver5 p2-7)
   changed: (walked) from 1192 to 1287
   goals met: 13 of 14
110. (walk driver5 p2-7 s7)
   deleted: (at driver5 p2-7)
   added: (at driver5 s7)
   changed: (walked) from 1287 to 1347
   goals met: 14 of 14
